Revit 2025 API
LightFamily.SetLightShapeStyle Method
 Set the light shape style to the given shape style
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetLightShapeStyle(
	LightShapeStyle lightShapeStyle
)
Public Sub SetLightShapeStyle (
	lightShapeStyle As LightShapeStyle
)
public:
void SetLightShapeStyle(
	LightShapeStyle lightShapeStyle
)
member SetLightShapeStyle :
        lightShapeStyle : LightShapeStyle -> unit
Parameters
lightShapeStyle LightShapeStyle
 The light shape style value to set the light shape style to
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Example
public void ModifyLightShapeStyle(Document familyDoc)
{
    // Get the light family from the static method.
    LightFamily lightFamily = LightFamily.GetLightFamily(familyDoc);
    // Set the light shape style to circle
    lightFamily.SetLightShapeStyle( LightShapeStyle.Circle);
    // After light shape style set to circle, each type returns a CircleLightShape instance
    for (int index = 0; index < lightFamily.GetNumberOfLightTypes(); index++)
    {
        LightType lightData = lightFamily.GetLightType(index);
        CircleLightShape lightShapeInType = lightData.GetLightShape() as CircleLightShape;
    }
}
Public Sub ModifyLightShapeStyle(familyDoc As Document)
   ' Get the light family from the static method.
   Dim lightFamily__1 As LightFamily = LightFamily.GetLightFamily(familyDoc)
   ' Set the light shape style to circle
   lightFamily__1.SetLightShapeStyle(LightShapeStyle.Circle)
   ' After light shape style set to circle, each type returns a CircleLightShape instance
   For index As Integer = 0 To lightFamily__1.GetNumberOfLightTypes() - 1
      Dim lightData As LightType = lightFamily__1.GetLightType(index)
      Dim lightShapeInType As CircleLightShape = TryCast(lightData.GetLightShape(), CircleLightShape)
   Next
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace